; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 59)
	(= (value c1) 81)
	(= (value c2) 88)
	(= (value c3) 20)
	(= (value c4) 51)
	(= (value c5) 45)
	(= (value c6) 87)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 6
2. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 6
3. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 6
4. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 6
5. (increment c5)
   changed: (value c5) from 45 to 49
   goals met: 4 of 6
6. (increment c5)
   changed: (value c5) from 49 to 53
   goals met: 5 of 6
7. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 6
8. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 6
9. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 6
10. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 6
11. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 5 of 6
12. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 5 of 6
13. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 5 of 6
14. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 5 of 6
15. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 5 of 6
16. (increment c3)
   changed: (value c3) from 20 to 29
   goals met: 5 of 6
17. (increment c3)
   changed: (value c3) from 29 to 38
   goals met: 5 of 6
18. (increment c3)
   changed: (value c3) from 38 to 47
   goals met: 5 of 6
19. (increment c3)
   changed: (value c3) from 47 to 56
   goals met: 4 of 6
20. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 6
21. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 6
22. (increment c3)
   changed: (value c3) from 56 to 65
   goals met: 4 of 6
23. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 4 of 6
24. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 6
25. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 6
26. (increment c3)
   changed: (value c3) from 65 to 75
   goals met: 4 of 6
27. (decrement c2)
   changed: (value c2) from 88 to 86
   goals met: 4 of 6
28. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 6
29. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 6
30. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 6
31. (increment c4)
   changed: (value c4) from 51 to 56
   goals met: 3 of 6
32. (increment c4)
   changed: (value c4) from 56 to 61
   goals met: 3 of 6
33. (increment c5)
   changed: (value c5) from 53 to 57
   goals met: 3 of 6
34. (increment c5)
   changed: (value c5) from 57 to 61
   goals met: 3 of 6
35. (increment c5)
   changed: (value c5) from 61 to 65
   goals met: 4 of 6
36. (increment c4)
   changed: (value c4) from 61 to 66
   goals met: 3 of 6
37. (increment c5)
   changed: (value c5) from 65 to 69
   goals met: 4 of 6
38. (increment c4)
   changed: (value c4) from 66 to 71
   goals met: 3 of 6
39. (increment c5)
   changed: (value c5) from 69 to 73
   goals met: 4 of 6
40. (increment c4)
   changed: (value c4) from 71 to 76
   goals met: 4 of 6
41. (increment c5)
   changed: (value c5) from 73 to 77
   goals met: 5 of 6
42. (increment c3)
   changed: (value c3) from 75 to 85
   goals met: 4 of 6
43. (increment c4)
   changed: (value c4) from 76 to 81
   goals met: 3 of 6
44. (increment c5)
   changed: (value c5) from 77 to 81
   goals met: 3 of 6
45. (increment c5)
   changed: (value c5) from 81 to 85
   goals met: 4 of 6
46. (increment c4)
   changed: (value c4) from 81 to 86
   goals met: 4 of 6
47. (increment c5)
   changed: (value c5) from 85 to 89
   goals met: 4 of 6
48. (decrement c2)
   changed: (value c2) from 86 to 84
   goals met: 5 of 6
49. (decrement c5)
   changed: (value c5) from 89 to 85
   goals met: 5 of 6
50. (decrement c4)
   changed: (value c4) from 86 to 81
   goals met: 5 of 6
51. (decrement c3)
   changed: (value c3) from 85 to 75
   goals met: 5 of 6
52. (decrement c2)
   changed: (value c2) from 84 to 82
   goals met: 5 of 6
53. (decrement c2)
   changed: (value c2) from 82 to 80
   goals met: 4 of 6
54. (decrement c2)
   changed: (value c2) from 80 to 78
   goals met: 4 of 6
55. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 6
56. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 6
57. (decrement c2)
   changed: (value c2) from 78 to 76
   goals met: 4 of 6
58. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 6
59. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 6
60. (decrement c2)
   changed: (value c2) from 76 to 74
   goals met: 5 of 6
61. (decrement c1)
   changed: (value c1) from 81 to 77
   goals met: 5 of 6
62. (decrement c1)
   changed: (value c1) from 77 to 73
   goals met: 6 of 6
